// Go 语言中，函数定义后的大括号不能单独一行，Rust 中则可以
fn fn01() {
    // 1. 使用数组字面量，省略数组类型，由编译器自动推断
    // 数组声明后，长度不可改变
    let one = [ 1, 2, 3 ];

    // 2. 使用数组字面量，并指定数组元素类型和长度
    let two: [u8; 3] = [ 1, 2, 3 ];

    // 3. 使用重复表达式，和数组字面量一样，用中括号包裹，但是分隔元素的是分号，分号前面是每个元素的值，分号后面是元素的数量，这个有点像 numpy 的 zero 函数
    let three = [0; 3];

    // 4. 使用重复表达式，并指定数组元素类型和长度
    // [u8; 3] 与 [u8; 5] 是两种不同的类型
    let four: [u8; 3] = [0; 3];

    // 5. 构建二维数组
    let arrays = [one, two, three, four];

    for a in &arrays {
        print!("{:?}: ", a);

        for n in a.iter() {
            // *n = *n + 1;
            print!("\t{} + 10 = {}", *n, *n + 10);
        }

        let mut sum = 0;

        for i in 0..a.len() {
            sum += a[i]
        }

        println!("\tΣ{:?} = {}", a, sum);
    }
}
